/**
 * PNG
 * 1、透明无损压缩；
   2、渐进显示和流式读写；
   3、保留图像名称、作者、版权、创作时间。
 * JPEG
    是一种针对照片视频而广泛使用的一种有损压缩标准方法.压缩过程中图像的质量会遭受到可见的破坏
 * GIF
 * 是一种位图图形文件格式，以8位色（即256种颜色）重现真彩色的图像.
 * 1、优秀的压缩算法使其在一定程度上保证图像质量的同时将体积变得很小；
   2、可插入多帧，从而实现动画效果；
 * 
   SVG（Scalable Vector Graphics，可缩放矢量图形）

       图片格式	压缩方式	动画	适应浏览器
       PNG	无损	不支持	所有
       JPEG	有损/无损	不支持	所有
       JPEG 2000	有损/无损	不支持	见浏览器兼容一览表
       APNG	无损	支持	见浏览器兼容一览表
       GIF	无损	支持	所有
       SVG	无损	支持	见浏览器兼容一览表（主要用于移动端font-face）
       WebP	有损/无损	支持	见浏览器兼容一览表



 */