/**
 * CDN的全称是Content Delivery Network，即内容分发网络。
 * 
 * CDN的设计思路是尽可能避开互联网上有可能影响数据传输速度和稳定性的瓶颈和环节，使内容传输的更快、更稳定。
 * 
   通过在网络各处放置节点服务器，所构成的在现有的互联网基础之上的一层智能虚拟网络，

   CDN系统能够实时监测网络流量和各节点的连接、负载状况以及到用户的距离和响应时间等综合信息将用户的请求。


 * 
 * ，其工作流程可以总结为：当用户访问已经加入CDN服务的网站时，
 * 首先通过DNS重定向技术确定最接近用户的最佳CDN节点，同时将用户的请求指向该节点。
 * 当用户的请求到达指定节点时，CDN的服务器（节点上的高速缓存）负责将用户请求的内容提供给用户。
 * 具体流程为: 用户在自己的浏览器中输入要访问的网站的域名，浏览器向本地DNS请求对该域名的解析，
 * 本地DNS将请求发到网站的主DNS，主DNS根据一系列的策略确定当时最适当的CDN节点，
 * 并将解析的结果（IP地址）发给用户，用户向给定的CDN节点请求相应网站的内容。

 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 * 
 */